<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"4bc2b15b5b42ab23877e5e6c3492f48257b064db5ea002cc2d9bc7730c6d8ab9","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #1248 at https://github.com/cal-itp/data-infra/actions/runs/20585782690","plan_out_hash":"e59fbccb4b80b6fcfeddfef4293ef01f2ffa78deab8066275bfaa87d4dc4f503","plan_hash":"caad4bad35dcfa25a332b6a87bd41ef43a158845ea695a4662091e7c23a6ff0e","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 0 to add, 3 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "/nZZag==" -> (known after apply)
!~      detect_md5hash      = "Fsc/VQRZ0R0teBZ6A0La/w==" -> "different hash"
!~      generation          = 1766180951970050 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "Fsc/VQRZ0R0teBZ6A0La/w==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/mart/gtfs/fct_stop_time_metrics.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "qZGxUA==" -> (known after apply)
!~      detect_md5hash      = "K380q4XbgsjZUFpjoFQLpw==" -> "different hash"
!~      generation          = 1767050874656493 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/mart/gtfs/fct_stop_time_metrics.sql"
!~      md5hash             = "K380q4XbgsjZUFpjoFQLpw==" -> (known after apply)
        name                = "data/warehouse/models/mart/gtfs/fct_stop_time_metrics.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "Komqfw==" -> (known after apply)
!~      detect_md5hash      = "V9C8fFGP2aUr8HlZphMlpg==" -> "different hash"
!~      generation          = 1766180953481112 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "V9C8fFGP2aUr8HlZphMlpg==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #1248](https://github.com/cal-itp/data-infra/actions/runs/20585782690)